Tekla.Structures.Drawing.ClosedGraphicObject
The ClosedGraphicObject class is an abstract base class for all closed graphic objects
(the circle, the cloud, the rectangular cloud, the polygon and the rectangle).